In [1]:
import pandas as pd

In [5]:
y = [3, 5, 7, 10, 12]

## Start with the first point
forcast = [y[0]]
alpha = .3

for i in range(1, len(y)):
    predict = alpha * y[i - 1] + (1 - alpha) * forcast[i - 1]
    forcast.append(predict)

forcast

[3,
 2.9999999999999996,
 3.5999999999999996,
 4.619999999999999,
 6.233999999999999]

In [4]:
len(y)

5

In [6]:
type(y)

list

In [7]:
a=forcast

In [8]:
a

[3,
 2.9999999999999996,
 3.5999999999999996,
 4.619999999999999,
 6.233999999999999]

In [9]:
chetan=pd.read_csv('eggs_single_exponential.csv')

In [10]:
y=[chetan]

In [11]:
type(y)

list

In [55]:
y

[     Eggs_Sold
 0        300.0
 1        450.0
 2        538.0
 3        756.0
 4        875.0
 ..         ...
 129    19075.0
 130    19220.6
 131    19366.2
 132    19511.8
 133    19657.4

 [134 rows x 1 columns]]

In [12]:
y1=pd.DataFrame(chetan,columns=['Eggs_Sold'])

In [13]:
y1

     Eggs_Sold
0        300.0
1        450.0
2        538.0
3        756.0
4        875.0
..         ...
129    19075.0
130    19220.6
131    19366.2
132    19511.8
133    19657.4

[134 rows x 1 columns]

In [14]:
len(y1)

134

In [31]:
y1.loc[0:1]

   Eggs_Sold
0      300.0
1      450.0

In [15]:
import numpy as np

In [41]:
y=np.array(y1)

In [42]:
y

array([[  300. ],
       [  450. ],
       [  538. ],
       [  756. ],
       [  875. ],
       [ 1020.6],
       [ 1166.2],
       [ 1311.8],
       [ 1457.4],
       [ 1603. ],
       [ 1748.6],
       [ 1894.2],
       [ 2039.8],
       [ 2185.4],
       [ 2331. ],
       [ 2476.6],
       [ 2622.2],
       [ 2767.8],
       [ 2913.4],
       [ 3059. ],
       [ 3204.6],
       [ 3350.2],
       [ 3495.8],
       [ 3641.4],
       [ 3787. ],
       [ 3932.6],
       [ 4078.2],
       [ 4223.8],
       [ 4369.4],
       [ 4515. ],
       [ 4660.6],
       [ 4806.2],
       [ 4951.8],
       [ 5097.4],
       [ 5243. ],
       [ 5388.6],
       [ 5534.2],
       [ 5679.8],
       [ 5825.4],
       [ 5971. ],
       [ 6116.6],
       [ 6262.2],
       [ 6407.8],
       [ 6553.4],
       [ 6699. ],
       [ 6844.6],
       [ 6990.2],
       [ 7135.8],
       [ 7281.4],
       [ 7427. ],
       [ 7572.6],
       [ 7718.2],
       [ 7863.8],
       [ 8009.4],
       [ 8155. ],
       [ 8300.6],
       [ 8446.2],
       [ 8591.8],
       [ 8737.4],
       [ 8883. ],
       [ 9028.6],
       [ 9174.2],
       [ 9319.8],
       [ 9465.4],
       [ 9611. ],
       [ 9756.6],
       [ 9902.2],
       [10047.8],
       [10193.4],
       [10339. ],
       [10484.6],
       [10630.2],
       [10775.8],
       [10921.4],
       [11067. ],
       [11212.6],
       [11358.2],
       [11503.8],
       [11649.4],
       [11795. ],
       [11940.6],
       [12086.2],
       [12231.8],
       [12377.4],
       [12523. ],
       [12668.6],
       [12814.2],
       [12959.8],
       [13105.4],
       [13251. ],
       [13396.6],
       [13542.2],
       [13687.8],
       [13833.4],
       [13979. ],
       [14124.6],
       [14270.2],
       [14415.8],
       [14561.4],
       [14707. ],
       [14852.6],
       [14998.2],
       [15143.8],
       [15289.4],
       [15435. ],
       [15580.6],
       [15726.2],
       [15871.8],
       [16017.4],
       [16163. ],
       [16308.6],
       [16454.2],
       [16599.8],
       [16745.4],
       [16891. ],
       [17036.6],
       [17182.2],
       [17327.8],
       [17473.4],
       [17619. ],
       [17764.6],
       [17910.2],
       [18055.8],
       [18201.4],
       [18347. ],
       [18492.6],
       [18638.2],
       [18783.8],
       [18929.4],
       [19075. ],
       [19220.6],
       [19366.2],
       [19511.8],
       [19657.4]])

In [43]:
forcast = [y[0]]
alpha = .3

for i in range(1, len(y)):
    predict = alpha * y[i - 1] + (1 - alpha) * forcast[i - 1]
    forcast.append(predict)

forcast

[array([300.]),
 array([300.]),
 array([345.]),
 array([402.9]),
 array([508.83]),
 array([618.681]),
 array([739.2567]),
 array([867.33969]),
 array([1000.677783]),
 array([1137.6944481]),
 array([1277.28611367]),
 array([1418.68027957]),
 array([1561.3361957]),
 array([1704.87533699]),
 array([1849.03273589]),
 array([1993.62291512]),
 array([2138.51604059]),
 array([2283.62122841]),
 array([2428.87485989]),
 array([2574.23240192]),
 array([2719.66268134]),
 array([2865.14387694]),
 array([3010.66071386]),
 array([3156.2024997]),
 array([3301.76174979]),
 array([3447.33322485]),
 array([3592.9132574]),
 array([3738.49928018]),
 array([3884.08949612]),
 array([4029.68264729]),
 array([4175.2778531]),
 array([4320.87449717]),
 array([4466.47214802]),
 array([4612.07050361]),
 array([4757.66935253]),
 array([4903.26854677]),
 array([5048.86798274]),
 array([5194.46758792]),
 array([5340.06731154]),
 array([5485.66711808]),
 array([5631.26698266]),
 array([5776.86688786]),
 array([5922.4668215]),
 array([6068.06677505]),
 array([6213.66674254]),
 array([6359.26671977]),
 array([6504.86670384]),
 array([6650.46669269]),
 array([6796.06668488]),
 array([6941.66667942]),
 array([7087.26667559]),
 array([7232.86667291]),
 array([7378.46667104]),
 array([7524.06666973]),
 array([7669.66666881]),
 array([7815.26666817]),
 array([7960.86666772]),
 array([8106.4666674]),
 array([8252.06666718]),
 array([8397.66666703]),
 array([8543.26666692]),
 array([8688.86666684]),
 array([8834.46666679]),
 array([8980.06666675]),
 array([9125.66666673]),
 array([9271.26666671]),
 array([9416.8666667]),
 array([9562.46666669]),
 array([9708.06666668]),
 array([9853.66666668]),
 array([9999.26666667]),
 array([10144.86666667]),
 array([10290.46666667]),
 array([10436.06666667]),
 array([10581.66666667]),
 array([10727.26666667]),
 array([10872.86666667]),
 array([11018.46666667]),
 array([11164.06666667]),
 array([11309.66666667]),
 array([11455.26666667]),
 array([11600.86666667]),
 array([11746.46666667]),
 array([11892.06666667]),
 array([12037.66666667]),
 array([12183.26666667]),
 array([12328.86666667]),
 array([12474.46666667]),
 array([12620.06666667]),
 array([12765.66666667]),
 array([12911.26666667]),
 array([13056.86666667]),
 array([13202.46666667]),
 array([13348.06666667]),
 array([13493.66666667]),
 array([13639.26666667]),
 array([13784.86666667]),
 array([13930.46666667]),
 array([14076.06666667]),
 array([14221.66666667]),
 array([14367.26666667]),
 array([14512.86666667]),
 array([14658.46666667]),
 array([14804.06666667]),
 array([14949.66666667]),
 array([15095.26666667]),
 array([15240.86666667]),
 array([15386.46666667]),
 array([15532.06666667]),
 array([15677.66666667]),
 array([15823.26666667]),
 array([15968.86666667]),
 array([16114.46666667]),
 array([16260.06666667]),
 array([16405.66666667]),
 array([16551.26666667]),
 array([16696.86666667]),
 array([16842.46666667]),
 array([16988.06666667]),
 array([17133.66666667]),
 array([17279.26666667]),
 array([17424.86666667]),
 array([17570.46666667]),
 array([17716.06666667]),
 array([17861.66666667]),
 array([18007.26666667]),
 array([18152.86666667]),
 array([18298.46666667]),
 array([18444.06666667]),
 array([18589.66666667]),
 array([18735.26666667]),
 array([18880.86666667]),
 array([19026.46666667]),
 array([19172.06666667])]

In [44]:
forecasted_sales = pd.DataFrame(forcast, columns=['forecast'])

In [45]:
forecasted_sales

         forecast
0      300.000000
1      300.000000
2      345.000000
3      402.900000
4      508.830000
..            ...
129  18589.666667
130  18735.266667
131  18880.866667
132  19026.466667
133  19172.066667

[134 rows x 1 columns]

In [47]:
y1

     Eggs_Sold
0        300.0
1        450.0
2        538.0
3        756.0
4        875.0
..         ...
129    19075.0
130    19220.6
131    19366.2
132    19511.8
133    19657.4

[134 rows x 1 columns]

In [53]:
type(y1)

pandas.core.frame.DataFrame

In [54]:
actual=pd.DataFrame(y1, columns=['Eggs_Sold'])

In [55]:
actual

     Eggs_Sold
0        300.0
1        450.0
2        538.0
3        756.0
4        875.0
..         ...
129    19075.0
130    19220.6
131    19366.2
132    19511.8
133    19657.4

[134 rows x 1 columns]

In [56]:
forecasted_sales

         forecast
0      300.000000
1      300.000000
2      345.000000
3      402.900000
4      508.830000
..            ...
129  18589.666667
130  18735.266667
131  18880.866667
132  19026.466667
133  19172.066667

[134 rows x 1 columns]

In [119]:
type(actual)

pandas.core.frame.DataFrame

In [120]:
type(forecasted_sales)

pandas.core.frame.DataFrame

In [57]:
s=actual.loc[0:135]

In [58]:
s

     Eggs_Sold
0        300.0
1        450.0
2        538.0
3        756.0
4        875.0
..         ...
129    19075.0
130    19220.6
131    19366.2
132    19511.8
133    19657.4

[134 rows x 1 columns]

In [59]:
t=forecasted_sales.loc[0:135]

In [60]:
t

         forecast
0      300.000000
1      300.000000
2      345.000000
3      402.900000
4      508.830000
..            ...
129  18589.666667
130  18735.266667
131  18880.866667
132  19026.466667
133  19172.066667

[134 rows x 1 columns]

In [61]:
error=pd.merge(s, t, left_index=True, right_index=True)

In [62]:
error

     Eggs_Sold      forecast
0        300.0    300.000000
1        450.0    300.000000
2        538.0    345.000000
3        756.0    402.900000
4        875.0    508.830000
..         ...           ...
129    19075.0  18589.666667
130    19220.6  18735.266667
131    19366.2  18880.866667
132    19511.8  19026.466667
133    19657.4  19172.066667

[134 rows x 2 columns]

In [ ]:
#Calculate MSE and MAPE